app/controllers/home_controller.rb

  def top
    @posts = Post.all.order(created_at: :desc).limit(1)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC