app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def new
    @posts = Post.all.order(created_at: :desc)

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "投稿"], ["created_at", "2020-05-19 16:09:27.899936"], ["updated_at", "2020-05-19 16:09:27.899936"]]
---
  def create
    @post = Post.new(content: params[:content])
    if @post.save